Repository: suesitran/flutter_localization_demo
Catalog: lib/l10n/intl_*.arb
Languages: vi

# simpleStringTitle
source: Simple string demo
vi: Demo chuỗi đơn giản

# simpleStringDemoText
source: This is a simple string
vi: Đây là một chuỗi chữ rất là đơn giản

# stringWithParamsTitle
source: Strings with params demo
vi: Demo text với params

source: Enter your name
vi: Nhập tên của bạn

source: Enter your age
vi: Nhập tuổi của bạn

source: Click me
vi: Kích vào đây

# hello
source: Hello {name}, you are {age} years old
vi: Xin Chào {name}, Bạn {age} tuổi

# stringWithSelectionsTitle
source: String with selections demo
vi: Demo chuỗi chữ với selections

source: Cars
vi: Xe hơi

source: Dolls
vi: Búp bê

source: Other toys
vi: Đồ chơi khác

# iLikeToPlay
source: {toy, select, cars {I like to play racing cars} dolls {I like to dress up dolls} other {I like to play other toys}}
vi: {toy, select, cars {Tôi thích chơi đua xe} dolls {Tôi thích chưng diện cho búp bê} other {Tôi có những sở thích khác}}

# pluralStringDemoTitle
source: Plural String Demo
vi: Chuỗi với số

# youHavePressThisButtonManyTimes
source: {counter, plural, zero {You have not clicked the button yet} one {You have clicked the button 1 time} other {You have clicked the button {counter} times}}
vi: {counter, plural, zero {Bạn chưa nhấn nút lần nào} one {Bạn đã nhấn nút 1 lần} other {Bạn đã nhất nút {counter} lần}}

# complexStringDemoTitle
source: Complex String Demo
vi: Chuỗi phức tạp

# summaryAboutYou
source: {toys, select, cars {Your name is {name}, {age} years old, and you love to play racing cars} dolls {Your name is {name}, and you are {age} years old, and you love to dress up dolls} other {You are {name}, {age} years old}}
vi: {toys, select, cars {Bạn tên là {name}, {age} tuổi, và bạn thích chơi đua xe} dolls {Tên bạn là {name}, và bạn {age} tuổi, và bạn thích chưng diện cho búp bê} other {Bạn tên là {name}, {age} tuổi}}
